import {
    Box,
    FormControl,
    FormLabel,
    HStack,
    Icon,
    IconButton,
    IconProps,
    Input,
    InputGroup,
    InputRightElement,
    Select,
    Switch,
} from '@chakra-ui/react';

import classes from './SearchBar.module.css';

export const SearchBar = () => (
    <Box>
        <HStack mb={4} gap={3}>
            <IconButton
                variant='outline'
                borderColor='blackAlpha.600'
                className={classes.filterButton}
                size={{ base: 'sm', lg: 'lg' }}
                icon={<FilterIcon boxSize={{ base: '1em', lg: 6 }} />}
                aria-label='Применить фильтр к поиску'
            />
            <InputGroup>
                <Input
                    size={{ base: 'sm', lg: 'lg' }}
                    borderColor='blackAlpha.600'
                    borderRadius={{ base: 'base', lg: 'md' }}
                    _placeholder={{ color: 'lime.800' }}
                    _hover={{ borderColor: 'blackAlpha.600' }}
                    _focus={{ boxShadow: 'none', borderColor: 'blackAlpha.600' }}
                    placeholder='Название или ингридиент...'
                />
                <InputRightElement h='full' w='auto' px={{ base: 2, lg: 4 }}>
                    <SearchIcon boxSize={{ base: 3.5, lg: 4.5 }} />
                </InputRightElement>
            </InputGroup>
        </HStack>
        <HStack gap={3} pl={2} hideBelow='lg'>
            <FormControl display='flex' alignItems='center'>
                <FormLabel w='max-content' htmlFor='exclude-allergens' mb={0}>
                    Исключить мои аллергены
                </FormLabel>
                <Switch id='exclude-allergens' />
            </FormControl>
            <Select color='blackAlpha.700' placeholder='Выберите из списка...' />
        </HStack>
    </Box>
);

const SearchIcon = (props: IconProps) => (
    <Icon viewBox='0 0 18 18' boxSize='1em' {...props}>
        <path
            d='M13.2098 11.637C14.2991 10.1505 14.787 8.30754 14.5759 6.47678C14.3647 4.64603 13.4701 2.9625 12.071 1.76301C10.6719 0.563527 8.8715 -0.063455 7.02997 0.00750229C5.18845 0.0784596 3.44162 0.842123 2.13896 2.14571C0.836304 3.4493 0.0738903 5.19668 0.00425079 7.03825C-0.0653888 8.87983 0.562881 10.6798 1.76337 12.078C2.96385 13.4763 4.64802 14.3697 6.47893 14.5795C8.30984 14.7894 10.1525 14.3001 11.6382 13.2097H11.637C11.6708 13.2547 11.7068 13.2975 11.7473 13.3391L16.0785 17.6704C16.2895 17.8815 16.5756 18.0001 16.8741 18.0002C17.1725 18.0003 17.4587 17.8819 17.6698 17.6709C17.8809 17.46 17.9996 17.1738 17.9997 16.8754C17.9998 16.577 17.8814 16.2907 17.6704 16.0796L13.3392 11.7484C13.2989 11.7077 13.2557 11.67 13.2098 11.6359V11.637ZM13.5 7.31249C13.5 8.12505 13.34 8.92964 13.029 9.68034C12.7181 10.431 12.2623 11.1132 11.6878 11.6877C11.1132 12.2623 10.4311 12.718 9.68039 13.029C8.92969 13.3399 8.12509 13.5 7.31253 13.5C6.49998 13.5 5.69538 13.3399 4.94468 13.029C4.19398 12.718 3.51187 12.2623 2.93731 11.6877C2.36275 11.1132 1.90698 10.431 1.59603 9.68034C1.28508 8.92964 1.12503 8.12505 1.12503 7.31249C1.12503 5.67146 1.77693 4.09765 2.93731 2.93727C4.09769 1.77689 5.67151 1.12499 7.31253 1.12499C8.95356 1.12499 10.5274 1.77689 11.6878 2.93727C12.8481 4.09765 13.5 5.67146 13.5 7.31249V7.31249Z'
            fill='currentColor'
        />
    </Icon>
);

const FilterIcon = (props: IconProps) => (
    <Icon viewBox='0 0 24 24' boxSize='1em' {...props}>
        <path
            d='M9 15.75C9 15.5511 9.07902 15.3603 9.21967 15.2197C9.36032 15.079 9.55109 15 9.75 15H14.25C14.4489 15 14.6397 15.079 14.7803 15.2197C14.921 15.3603 15 15.5511 15 15.75C15 15.9489 14.921 16.1397 14.7803 16.2803C14.6397 16.421 14.4489 16.5 14.25 16.5H9.75C9.55109 16.5 9.36032 16.421 9.21967 16.2803C9.07902 16.1397 9 15.9489 9 15.75ZM6 11.25C6 11.0511 6.07902 10.8603 6.21967 10.7197C6.36032 10.579 6.55109 10.5 6.75 10.5H17.25C17.4489 10.5 17.6397 10.579 17.7803 10.7197C17.921 10.8603 18 11.0511 18 11.25C18 11.4489 17.921 11.6397 17.7803 11.7803C17.6397 11.921 17.4489 12 17.25 12H6.75C6.55109 12 6.36032 11.921 6.21967 11.7803C6.07902 11.6397 6 11.4489 6 11.25ZM3 6.75C3 6.55109 3.07902 6.36032 3.21967 6.21967C3.36032 6.07902 3.55109 6 3.75 6H20.25C20.4489 6 20.6397 6.07902 20.7803 6.21967C20.921 6.36032 21 6.55109 21 6.75C21 6.94891 20.921 7.13968 20.7803 7.28033C20.6397 7.42098 20.4489 7.5 20.25 7.5H3.75C3.55109 7.5 3.36032 7.42098 3.21967 7.28033C3.07902 7.13968 3 6.94891 3 6.75Z'
            fill='currentColor'
        />
    </Icon>
);
